from etap1 import run_to_final

# Целевая функция: минимизировать общее число врачей
c = [1, 1, 1, 1, 1, 1]

# Матрица ограничений (6x6)
A = [
    [1, 0, 0, 0, 0, 1],  # x6 + x1 >= 40
    [1, 1, 0, 0, 0, 0],  # x1 + x2 >= 30
    [0, 1, 1, 0, 0, 0],  # x2 + x3 >= 20
    [0, 0, 1, 1, 0, 0],  # x3 + x4 >= 50
    [0, 0, 0, 1, 1, 0],  # x4 + x5 >= 80
    [0, 0, 0, 0, 1, 1]   # x5 + x6 >= 100
]

b = [40, 30, 20, 50, 80, 100]

# Знаки ограничений
signs = [">=", ">=", ">=", ">=", ">=", ">="]



final_df, final_basis = run_to_final(c, A, b, signs)
